# Pandas tutorial [Day-11]

- This notebook explains 

- Step 1: Raw data/Data extraction
- Step 2: Data cleaning 
- Step 3: Data filtration 
- Step 4: Data removal/ ignoring 
- Step 5: Data organisation 
- Step 6: Data joining 
- Step 7: Data splitting 
- Step 8: Finding missing data 
- Step 9: Duplicate removal 
- Step 10: Getting readable data 
- Step 11: Data analysis 
- Step 12: Plotting graph and statistics 
- Step 13: Data reporting 
- Step 14: Data presentation

# Install libraries

In [1]:
#pip install pandas
#pip install numpy

- Import libraries

In [2]:
import pandas as pd
import numpy as np

- Object creation

In [3]:
s = pd.Series([1,2,3,4,5,3,2])
s

0    1
1    2
2    3
3    4
4    5
5    3
6    2
dtype: int64

In [4]:
#empty cell
s = pd.Series([1,2,3,np.nan,4,5,3,2])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    4.0
5    5.0
6    3.0
7    2.0
dtype: float64

In [5]:
# define dates
dates = pd.date_range("20220623", periods=5)
dates

DatetimeIndex(['2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(5, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2022-06-23  1.484415  1.804020  0.396321 -0.927775
2022-06-24  0.885292  0.417252 -0.959192  0.097998
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212
2022-06-26 -1.645708  1.634689 -0.039662  0.546202
2022-06-27 -1.252740 -0.468944  0.339610 -0.978286

In [7]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [8]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

- viewing cell

In [10]:
df.head(2)

                   A         B         C         D
2022-06-23  1.484415  1.804020  0.396321 -0.927775
2022-06-24  0.885292  0.417252 -0.959192  0.097998

In [11]:
df.tail(3)

                   A         B         C         D
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212
2022-06-26 -1.645708  1.634689 -0.039662  0.546202
2022-06-27 -1.252740 -0.468944  0.339610 -0.978286

In [12]:
df.index

DatetimeIndex(['2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.to_numpy()

array([[ 1.48441511,  1.80402019,  0.39632058, -0.92777479],
       [ 0.88529174,  0.4172517 , -0.95919154,  0.0979976 ],
       [ 0.71872893, -0.58108595, -0.22185135, -1.08821192],
       [-1.64570768,  1.63468894, -0.03966202,  0.54620203],
       [-1.25273991, -0.46894429,  0.33960967, -0.97828599]])

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [15]:
df.describe()

              A         B         C         D
count  5.000000  5.000000  5.000000  5.000000
mean   0.037998  0.561186 -0.096955 -0.470015
std    1.394121  1.127355  0.546864  0.742527
min   -1.645708 -0.581086 -0.959192 -1.088212
25%   -1.252740 -0.468944 -0.221851 -0.978286
50%    0.718729  0.417252 -0.039662 -0.927775
75%    0.885292  1.634689  0.339610  0.097998
max    1.484415  1.804020  0.396321  0.546202

In [16]:
# transposing your data
df.T

   2022-06-23  2022-06-24  2022-06-25  2022-06-26  2022-06-27
A    1.484415    0.885292    0.718729   -1.645708   -1.252740
B    1.804020    0.417252   -0.581086    1.634689   -0.468944
C    0.396321   -0.959192   -0.221851   -0.039662    0.339610
D   -0.927775    0.097998   -1.088212    0.546202   -0.978286

In [17]:
#sorting by an axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-06-23 -0.927775  0.396321  1.804020  1.484415
2022-06-24  0.097998 -0.959192  0.417252  0.885292
2022-06-25 -1.088212 -0.221851 -0.581086  0.718729
2022-06-26  0.546202 -0.039662  1.634689 -1.645708
2022-06-27 -0.978286  0.339610 -0.468944 -1.252740

In [18]:
#sorting by values
df.sort_values(by="B")

                   A         B         C         D
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212
2022-06-27 -1.252740 -0.468944  0.339610 -0.978286
2022-06-24  0.885292  0.417252 -0.959192  0.097998
2022-06-26 -1.645708  1.634689 -0.039662  0.546202
2022-06-23  1.484415  1.804020  0.396321 -0.927775

- Selection

In [19]:
df["A"]

2022-06-23    1.484415
2022-06-24    0.885292
2022-06-25    0.718729
2022-06-26   -1.645708
2022-06-27   -1.252740
Freq: D, Name: A, dtype: float64

In [20]:
#row wise
df[0:3]

                   A         B         C         D
2022-06-23  1.484415  1.804020  0.396321 -0.927775
2022-06-24  0.885292  0.417252 -0.959192  0.097998
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212

In [21]:
df["20220625":"20220627"]

                   A         B         C         D
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212
2022-06-26 -1.645708  1.634689 -0.039662  0.546202
2022-06-27 -1.252740 -0.468944  0.339610 -0.978286

- Selection by label

In [22]:
df.loc[dates[0]]

A    1.484415
B    1.804020
C    0.396321
D   -0.927775
Name: 2022-06-23 00:00:00, dtype: float64

In [23]:
df.loc[:, ["A", "B"]]

                   A         B
2022-06-23  1.484415  1.804020
2022-06-24  0.885292  0.417252
2022-06-25  0.718729 -0.581086
2022-06-26 -1.645708  1.634689
2022-06-27 -1.252740 -0.468944

In [24]:
df.loc[["2022-06-23", "2022-06-25"], :]

                   A         B         C         D
2022-06-23  1.484415  1.804020  0.396321 -0.927775
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212

In [25]:
df.loc["2022-06-23":"2022-06-25", :]

                   A         B         C         D
2022-06-23  1.484415  1.804020  0.396321 -0.927775
2022-06-24  0.885292  0.417252 -0.959192  0.097998
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212

In [26]:
df.loc["2022-06-23":"2022-06-25", ["A","B"]]

                   A         B
2022-06-23  1.484415  1.804020
2022-06-24  0.885292  0.417252
2022-06-25  0.718729 -0.581086

In [27]:
df.loc["20220624", ["A", "B"]]

A    0.885292
B    0.417252
Name: 2022-06-24 00:00:00, dtype: float64

In [28]:
df.loc[dates[0], "A"]

1.484415107669837

In [29]:
df.at[dates[0], "A"]

1.484415107669837

- Selection by position

In [30]:
df.iloc[2]

A    0.718729
B   -0.581086
C   -0.221851
D   -1.088212
Name: 2022-06-25 00:00:00, dtype: float64

In [31]:
df.iloc[0:3,0:2]

                   A         B
2022-06-23  1.484415  1.804020
2022-06-24  0.885292  0.417252
2022-06-25  0.718729 -0.581086

In [32]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2022-06-24  0.885292 -0.959192
2022-06-25  0.718729 -0.221851
2022-06-27 -1.252740  0.339610

In [33]:
df.iloc[1:3, :]

                   A         B         C         D
2022-06-24  0.885292  0.417252 -0.959192  0.097998
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212

In [34]:
df.iloc[:, 1:3]

                   B         C
2022-06-23  1.804020  0.396321
2022-06-24  0.417252 -0.959192
2022-06-25 -0.581086 -0.221851
2022-06-26  1.634689 -0.039662
2022-06-27 -0.468944  0.339610

In [35]:
df.iloc[1, 1]

0.4172516957434973

In [36]:
df.iat[1, 3]

0.09799760449302657

- Boolean indexing

In [37]:
df[df["A"] > 1]

                   A        B         C         D
2022-06-23  1.484415  1.80402  0.396321 -0.927775

In [38]:
df[df["A"] < 1]

                   A         B         C         D
2022-06-24  0.885292  0.417252 -0.959192  0.097998
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212
2022-06-26 -1.645708  1.634689 -0.039662  0.546202
2022-06-27 -1.252740 -0.468944  0.339610 -0.978286

In [39]:
df[df<0]

                   A         B         C         D
2022-06-23       NaN       NaN       NaN -0.927775
2022-06-24       NaN       NaN -0.959192       NaN
2022-06-25       NaN -0.581086 -0.221851 -1.088212
2022-06-26 -1.645708       NaN -0.039662       NaN
2022-06-27 -1.252740 -0.468944       NaN -0.978286

In [40]:
df[df>0]

                   A         B         C         D
2022-06-23  1.484415  1.804020  0.396321       NaN
2022-06-24  0.885292  0.417252       NaN  0.097998
2022-06-25  0.718729       NaN       NaN       NaN
2022-06-26       NaN  1.634689       NaN  0.546202
2022-06-27       NaN       NaN  0.339610       NaN

In [49]:
df2=df.copy()
df2["new"]=[4,6,"two","three",5]
df2["new"]

2022-06-23        4
2022-06-24        6
2022-06-25      two
2022-06-26    three
2022-06-27        5
Freq: D, Name: new, dtype: object

In [42]:
df2["new2"]=[1,2,4.4,6,6.3]
df2

                   A         B         C         D    new  new2
2022-06-23  1.484415  1.804020  0.396321 -0.927775      4   1.0
2022-06-24  0.885292  0.417252 -0.959192  0.097998      6   2.0
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212    two   4.4
2022-06-26 -1.645708  1.634689 -0.039662  0.546202  three   6.0
2022-06-27 -1.252740 -0.468944  0.339610 -0.978286      5   6.3

In [43]:
df2=df2.iloc[:,0:4]
df2

                   A         B         C         D
2022-06-23  1.484415  1.804020  0.396321 -0.927775
2022-06-24  0.885292  0.417252 -0.959192  0.097998
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212
2022-06-26 -1.645708  1.634689 -0.039662  0.546202
2022-06-27 -1.252740 -0.468944  0.339610 -0.978286

In [44]:
df2.mean()

A    0.037998
B    0.561186
C   -0.096955
D   -0.470015
dtype: float64

In [45]:
df2.mean(1)

2022-06-23    0.689245
2022-06-24    0.110337
2022-06-25   -0.293105
2022-06-26    0.123880
2022-06-27   -0.590090
Freq: D, dtype: float64

In [50]:
df2[df2["new"].isin(["two", "three"])]

                   A         B         C         D    new
2022-06-25  0.718729 -0.581086 -0.221851 -1.088212    two
2022-06-26 -1.645708  1.634689 -0.039662  0.546202  three